; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 545700 2 2 3 8 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	image2 - mode
	thermograph1 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star7 - direction
	Star2 - direction
	GroundStation1 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph1)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(pointing satellite1 Star2)
	(have_image Star8 thermograph1)
	(have_image Phenomenon9 thermograph0)
	(have_image Planet10 thermograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (turn_to satellite1 star2 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star2)
   goals met: 1 of 5
3. (turn_to satellite0 planet10 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet10)
   goals met: 1 of 5
4. (turn_to satellite0 groundstation1 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 5
5. (turn_to satellite1 planet10 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet10)
   goals met: 0 of 5
6. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 5
7. (turn_to satellite1 star2 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star2)
   goals met: 1 of 5
8. (turn_to satellite0 star8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star8)
   goals met: 1 of 5
9. (turn_to satellite1 planet10 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet10)
   goals met: 0 of 5
10. (take_image satellite0 star8 instrument1 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 1 of 5
11. (turn_to satellite1 star2 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star2)
   goals met: 2 of 5
12. (turn_to satellite0 planet10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet10)
   goals met: 2 of 5
13. (turn_to satellite1 phenomenon9 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 5
14. (take_image satellite0 planet10 instrument1 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 2 of 5
15. (turn_to satellite1 star2 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star2)
   goals met: 3 of 5
16. (turn_to satellite0 phenomenon9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 5
17. (take_image satellite0 phenomenon9 instrument1 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 4 of 5
18. (turn_to satellite0 groundstation5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation5)
   goals met: 5 of 5
